package controllers

var ErrorCode = map[int][]string{

	1:[]string{"ok","ok"},
	2:[]string{"参数错误","参数错误"},
	3:[]string{"没有权限","没有权限"},
	10:[]string{"请先登录","还没有登录"},


	1001:[]string{"验证码错误","没有生成session,导致验证码验证错误"},
	1002:[]string{"账号或密码错误","账号或密码错误"},
	1003:[]string{"参数错误","参数错误"},
	1004:[]string{"姓名不能为空","姓名不能为空"},
	1005:[]string{"用户名不能为空","用户名不能为空"},
	1006:[]string{"手机号不能为空","手机号不能为空"},
	1007:[]string{"邮箱地址不能为空","邮箱地址不能为空"},
	1008:[]string{"是否超级管理员不能为空","是否超级管理员不能为空"},
	1009:[]string{"真实密码不能为空","真实密码不能为空"},
	1010:[]string{"角色不能为空","角色不能为空"},
	1011:[]string{"该菜单有子菜单，无法直接删除","该菜单有子菜单，无法直接删除"},

	2001:[]string{"任务正在执行，请先暂停任务","任务正在执行，请先暂停任务"},
	2002:[]string{"该任务还没有被程序初始化","该任务还没有被程序初始化"},
	2003:[]string{"该任务没有在执行，不需要暂停","该任务没有在执行，不需要暂停"},
	2004:[]string{"没有这个任务","数据库没有这个任务"},
	2005:[]string{"没有找到这个任务之前的运行日志，无法继续执行","数据库没有相关的运行日志"},
	2006:[]string{"启动失败","启动失败"},

}